const messages = {
    lang: {
        uk: 'Виберіть мову',
        ru: 'Выберите язык',
    },
    contacts: {
        uk: '👥 Контакти',
        ru: '👥 Контакты',
    },
    contactsText: {
        uk: '👥 Керування контактами',
        ru: '👥 Управление контактами',
    },
    info: {
        uk: 'Як це працює❔',
        ru: 'Как это работает❔',
    },
    'lang-setting': {
        uk: '⚙️ Мова',
        ru: '⚙️ Язык',
    },
    'red-btn': {
        uk: '📍 Червона кнопка 📍',
        ru: '📍 Красная кнопка 📍',
    },
    'red-btn-request': {
        uk: '📍 Відправити',
        ru: '📍 Отправить',
    },
    'red-btn-text': {
        uk: 'Відправка геопозиції',
        ru: 'Отправка геопозиции',
    },
    'contacts-list': {
        uk: 'Список контактів',
        ru: 'Список контактов',
    },
    'remove-list': {
        uk: 'Видалити',
        ru: 'Удалить',
    },
    'confirm-remove': {
        uk: 'Ви дійсно бажаєте видалити контакт',
        ru: 'Вы действительно хотите удалить контакт',
    },
    'remove-text': {
        uk: 'Виберіть користувача, якого бажаєте видалити.',
        ru: 'Выберите пользователя, которого хотите удалить.',
    },
    add: {
        uk: 'Додати',
        ru: 'Добавить',
    },
    'add-text': {
        uk: '✅ Надішліть посилання користувачеві, якого ви хочете додати!\n' +
            '\n' +
            '✅ Після підтвердження він буде успішно доданий.\n' +
            '\n' +
            'Щоб скопіювати, натисніть на посилання 👇\n',
        ru: '✅ Отправьте ссылку пользователю, которого вы хотите добавить! \n' +
            '\n' +
            '✅ После подтверждения, он будет успешно добавлен. \n' +
            '\n' +
            'Чтобы скопировать, нажмите на ссылку 👇' +
            '\n',
    },
    return: {
        uk: '⬅️ Назад',
        ru: '⬅️ Назад',
    },
    main: {
        uk: '↪️ Головне меню',
        ru: '↪️ Главное меню',
    },
    'add-confirm': {
        uk: 'бажає додати вас до свого списку контактів',
        ru: 'хочет добавить вас в список своих контактов',
    },
    confirm: {
        uk: '✅ Підвердити',
        ru: '✅ Подтвердить',
    },
    cancel: {
        uk: '❌ Відмінити',
        ru: '❌ Отменить',
    },
    alreadyExist: {
        uk: 'Ви вже є у списку контактів користувача',
        ru: 'Вы уже есть в списке контактов пользователя',
    },
    emptyList: {
        uk: 'Список контактів порожній',
        ru: 'Список контактов пуст',
    },
    emptyListDescription: {
        uk: 'Список контактів порожній. Додайте контакти, щоб надсилати геопозицію.',
        ru: 'Список контактов пуст. Добавьте контакты, чтобы отправлять геопозицию.',
    },
    emptyListMedia: {
        uk: 'Список контактів порожній. Додайте контакти, щоб надсилати фото/відео.',
        ru: 'Список контактов пуст. Добавьте контакты, чтобы отправлять фото/видео.',
    },
    infoText: {
        uk: 'У разі незаконного затримання або екстреної ситуації, ви можете надіслати свою геопозицію рідним та близьким.\n\n Для цього вам потрібно додати користувачів до списку 👥 контактів.\n\nЩоб надіслати геопозицію миттєво, натисніть на "📍Червону кнопку".\n\n⏳ Якщо ви не впевнені у ситуації, ви можете запустити таймер, який надішле вашу геопозицію у випадку, якщо ви не зупините таймер.\n\n 📸 Також ви можете надіслати фото/відео одразу всім своїм контактам. \n\n❗️Ми не зберігаємо вашу геопозицію, ми надсилаємо її лише вашим контактам.',
        ru: 'В случае незаконного задержания или экстренной ситуации, вы можете отправить свою геопозицию родным и близким.\n\n Для этого вам нужно добавить пользователей в список 👥 контактов.\n\nЧтобы отправить геопозицию мгновенно, нажмите на "📍Красную кнопку".\n\n⏳ Если вы не уверены в ситуации, то вы можете запустить таймер, который отправит вашу геопозицию в том случае, если вы не остановите таймер.\n\n 📸 Также вы можете отправить фото/видео сразу всем своим контактам. \n\n❗️Мы не сохраняем вашу геопозицию, мы отправляем её только вашим контактам.'
    },
    timer: {
        uk: '⏳ Таймер',
        ru: '⏳ Таймер',
    },
    timerText: {
        uk: 'Встановити таймер на:',
        ru: 'Установить таймер на:',
    },
    minutes: {
        uk: 'хвилин',
        ru: 'минут',
    },
    startTimer: {
        uk: '▶️ Запустити таймер',
        ru: '▶️ Запустить таймер',
    },
    locationReceivedTimer: {
        uk: '✅ Геопозиція отримана.',
        ru: '✅ Геопозиция получена.',
    },
    locationReceived: {
        uk: '✅ Геопозиція отримана. Відправка почалась.',
        ru: '✅ Геопозиция получена. Отправка началась.',
    },
    locationSent: {
        uk: '✅ Геопозицію відправлено вашим контактам',
        ru: '✅ Геопозиция отправлена вашим контактам',
    },
    timerStarted: {
        uk: '✅ Таймер встановлено, геопозиція буде відправлена, якщо ви не скасуєте таймер.',
        ru: '✅ Таймер запущен, геопозиция будет отправлена, если вы не остановите таймер.',
    },
    timerCanceled: {
        uk: '✅ Таймер скасовано',
        ru: '✅ Таймер отменён',
    },
    senderText: {
        uk: '️❗️️️️️Мені потрібна допомога❗️️️️️️️️',
        ru: '❗️Мне нужна помощь❗️',
    },
    media: {
        uk: '📸 Відправити фото/відео️️️️️️️',
        ru: '📸 Отправить фото/видео️',
    },
    mediaText: {
        uk: '📸 Відправте фото/відео в чат️, воно буде надіслано всім вашим контактам️️️️️️',
        ru: '️📸 Отправьте фото/видео в чат, оно будет отправлено всем вашим контактам',
    },
    photoReceived: {
        uk: '✅ Фото отримано. Відправка почалась️️️️️️️',
        ru: '✅ Фото получено. Отправка началась️',
    },
    videoReceived: {
        uk: '✅ Відео отримано. Відправка почалась️️️️️️️',
        ru: '✅ Видео получено. Отправка началась️',
    },
    mediaSent: {
        uk: '✅ Успішно відправлено вашим контактам',
        ru: '✅ Успешно отправлено вашим контактам',
    },
};
module.exports= { messages };
